Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: །སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ་ཞེས་བྱ་བ་ནི་ཐེག་པ་ཆེན་པོའི་བསྒྲུབ་པ་ལ་མ་བསླབས་པའི་སྦྱིན་པ་ལ་སོགས་པ་ནི་དོན་དམ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པར་མི་འགྱུར་རོ།
en: Bodhisattva great beings practicing the perfection of giving should train in the perfection of wisdom”— giving and so on without having trained in the Great Vehicle achievement is not the ultimate perfection. “

source: །སངས་རྒྱས་ཀྱི་སྐུ་མངོན་པར་བསྒྲུབ་པར་འདོད་པས་ཞེས་བྱ་བ་ནི་ས་བདུན་པ། ལ་སངས་རྒྱས་ཀྱི་སྐུ་བཀོད་པ་ཤེས་ཀྱང་དེའི་ཚེ་བསྒྲུབ་པར་ནི་མི་ནུས་ཀྱི།
en: Who want to thoroughly establish a buddha’s body”— on the seventh level they know the form of the body of a buddha but at that time cannot achieve it.

source: སངས་རྒྱས་ཀྱི་སྐུ་བཀོད་པ་ཤེས་ནས་ས་དེ་ལ་མངོན་པར་བསྒྲུབ་པར་འདོད་པ་ནི་སྐྱེའོ།
en: Having understood the form of the body of a buddha on that level they generate the desire to achieve it.

source: །འདི་ལྟར་ས་བཅུ་པ་ལས་ཀྱང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་རང་བཞིན་གྱི་ཆོས་ཀྱི་སྐུ་ཉིད་ལ་ཡང་འཇུག །གཟུགས་ཀྱི་སྐུའི་མཚན་དང་དཔེ་བྱད་བཟང་པོ་རྣམ་པར་བརྒྱན་པའི་རྒྱན་ཀྱང་མངོན་པར་སྒྲུབ། དེ་བཞིན་གཤེགས་པའི་གསུང་སྒྲ་སྐད་དང་བྲལ་ཞིང་བརྗོད་དུ་མེད་པ་རང་བཞིན་གྱིས་ཞི་བ་ལ་ཡང་མོས་པར་བྱེད་དོ་ཞེས་གསུངས་ཏེ།
en: Thus, it is saying that they enter into the intrinsic nature dharma body of all the buddhas from the tenth level; they also achieve the fine ornaments (the major marks and minor signs adorning the form body); and they cause the admiration of the tathāgata who is separated from speech, sound, and language, inexpressible, and naturally calm.

source: དེས་ནི་སྐུ་གསུམ་སྟོན་ཏོ།
en: Hence it teaches the three bodies. “

source: །སངས་རྒྱས་ཀྱི་རིགས་སུ་སྐྱེ་བར་འདོད་པས་ཞེས་བྱ་བ་ལ་དེ་བཞིན་གཤེགས་པའི་རིགས་ནི་འདིར་ཡོངས་སུ་གྲུབ་པའི་དེ་བཞིན་ཉིད་ལ་བྱ་སྟེ། ས་བརྒྱད་པ་ལ་རྣམ་པར་རྟོག་པ་ཐམས་ཅད་དང་། རྩོལ་བ་ཐམས་ཅད་དང་། མཚན་མ་ཐམས་ཅད་རྒྱུན་ཆད་པའི་ཕྱིར་རྣམ་པར་དག་པའི་དེ་བཞིན་ཉིད་ཀྱི་བདག་ཉིད་དུ་གནས་པར་གྱུར་པ་ལ་དེ་བཞིན་གཤེགས་པའི་རིགས་སུ་སྐྱེ་བ་ཞེས་བྱའོ།
en: Who want to be born in the buddha’s lineage”— here, take the tathāgata’s lineage to be the thoroughly established suchness, because at the eighth level all conceptualization, all exertion, and all causal signs are cut off, and there has been the transformation into the nature of purified suchness.

source: །གཞོན་ནུའི་ས་ཞེས་བྱ་བ་ནི་ས་བརྒྱད་པ་དེ་ཉིད་ལ་བྱ་སྟེ།
en: This is called being “born in the tathāgata’s lineage.” “The heir apparent’s level” is just that very eighth level.

source: འདི་ལྟར་ཤིན་ཏུ་ཁ་ན་མ་ཐོ་བ་མེད་པའི་ཕྱིར་གཞོན་ནུའི་ས་ཞེས་བྱའོ། །ཞེས་གསུངས་པའི་ཕྱིར།
en: Thus it says, “because it is totally without basic immorality it is called the heir apparent’s level.”

source: འཇིག་རྟེན་ཆོས་ཀྱི་དབྱིངས་ཀྱིས་ཀླས་པ་ཞེས་བྱ་བ་ནི་སེམས་ཅན་གྱི་འཇིག་རྟེན་ལ་བྱ་སྟེ། སེམས་ཅན་གྱི་འཇིག་རྟེན་ལ་ཡང་མཐའ་མེད་པའི་ཕྱིར་དེ་བཞིན་གཤེགས་པའི་སྙིང་པོས་ཀླས་པ་ཞེས་བྱའོ།
en: Take “a world as vast as the dharma-constituent” as the world in the sense of beings, because the world as beings is also without an end. It has the tathāgata­garbha as its terminus.

source: །ནམ་མཁའི་ཁམས་ཀྱི་མཐས་གཏུགས་པ་ཞེས་བྱ་བ་ནི་སྣོད་ཀྱི་འཇིག་རྟེན་ལ་བྱའོ།
en: The world that is “as far-reaching as the space element” is the world as container. “

source: །དགེ་བའི་སེམས་བསྐྱེད་པ་གཅིག་ཀྱང་མི་ཟད་པར་བྱ་བར་འདོད་པས་ཞེས་བྱ་བ་ནི་ཆུའི་ཐིགས་པ་གཅིག་རྒྱ་མཚོའི་ནང་དུ་བླུགས་པ་ཟད་པར་མི་འགྱུར་བ་བཞིན་དུ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོས་པ་ཡང་འཁོར་བའི་མཐའི་བར་དུ་སེམས་ཅན་གྱི་དོན་བྱེད་པའི་ཕྱིར་མི་ཟད་པ་ཞེས་བྱའོ།
en: Want to make a single wholesome thought of awakening inexhaustible”— it is inexhaustible just like a single drop of water poured into the ocean that does not run out because, dedicated to the knowledge of all aspects, it works for the welfare of beings until the end of saṃsāra.

source: །མི་ཟད་པ་དེ་ཡང་བློ་གྲོས་མི་ཟད་པའི་མདོ་ལས་བསྟན་པ་བཞིན་དུ་ཤེས་པར་བྱའོ།
en: Also understand the inexhaustible as it is explained in The Teaching of Akṣayamati. “

source: །སངས་རྒྱས་ཀྱི་རིགས་རྒྱུན་མི་ཆད་པར་བྱ་བའི་ཕྱིར་ཞེས་བྱ་བ་ནི་སངས་རྒྱས་ཀྱི་གདུང་རྒྱུན་མི་ཆད་པར་བྱ་བའི་ཕྱིར་ཏེ། སངས་རྒྱས་ཀྱི་རྒྱུན་མི་ཆད་པར་བྱ་བའི་ཕྱིར་རོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Want to ensure the line of buddhas will be unbroken” means to ensure the progeny necessary to continue the unbroken line, so that the line of buddhas will remain unbroken. “[

source: །ནང་སྟོང་པ་ཉིད་ལ་གནས་པར་འདོད་པས་ཞེས་བྱ་བ་ལ་སོགས་པས་སྟོང་པ་ཉིད་བཅུ་དྲུག་བསྟན་ཏོ།
en: They] want to stand in inner emptiness” and so on teaches the sixteen emptinesses.

source: །སྟོང་པ་ཉིད་ཀྱི་ངོ་བོ་ཉིད་ནི་གཅིག་ཏུ་ཟད་མོད་ཀྱི་འོན་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་དང་ཡིད་ལ་བྱེད་པ་ཐ་དད་པས་རྣམ་པ་མང་པོར་ཕྱེའོ།
en: It is true that emptiness, as an entity, is simply one. Nevertheless, it is divided into many types because of the different minds and interests of bodhisattvas.

source: །འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སྟོང་པ་ཉིད་ཡིད་ལ་བྱེད་པ་ལ་བརྩོན་པ་ན་འདི་སྙམ་དུ་སེམས་ཏེ། གལ་ཏེ་ཆོས་ཐམས་ཅད་སྟོང་སྟེ་ཡོད་པ་མ་ཡིན་ན་དགེ་སློང་དག་བདག་ཉིད་བདག་གི་མགོན་ཡིན་ནོ། །བདག་ཉིད་ཀྱིས་ལས་བྱས་པ་བདག་ལ་སྨིན་ནོ། །བདག་གླིང་དུ་གྱུར་པར་གནས་པར་གྱིས་ཤིག་ཅེས་བྱ་བ་ལ་སོགས་པའི་བདག་ཅེས་བྱ་བ་ཇི་ལྟ་བུ་ཞིག་སྙམ་དུ་བསམས་ནས།
en: Here, when bodhisattvas endeavor to pay attention to emptiness, they think, “If all dharmas are empty—that is, unreal—how does the ‘self’ in ‘Monks, I am my own master’; ‘The actions I did myself ripen in me’; ‘Stay by yourself in the form of an island’ and so on exist?”

source: དང་པོར་བདག་གི་ནང་གི་ཆོས་གཟུགས་དང་། ཚོར་བ་ལ་སོགས་པ་གང་ཡིན་པ་དེ་དག་བཟུང་སྟེ། བསམས་ན་བདག་ཅེས་བྱ་བ་བརྗོད་པར་བྱ་བའི་དངོས་པོ་དོན་དམ་པར་གང་ཡང་མེད་ཀྱི་འདི་དག་ནི་ཐ་སྙད་དུ་བརྗོད་པའི་དོན་འབའ་ཞིག་ཙམ་དུ་ཟད་དེ།
en: Having reflected on that, when they first take up in their mind these forms, feelings, and so on that are their own self’s inner dharmas and reflect on them, they perfectly review the fact that there is nothing that can be set forth as a “self” that ultimately exists.

source: །གློ་བུར་དུ་མིང་དུ་བཏགས་པ་ཡིན་ནོ།
en: These are simply things set forth just conventionally; they are names plucked out of thin air.

source: །ཞེས་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངོ་། །དེ་བས་ན་ནང་སྟོང་པ་ཉིད་ཅེས་བྱ་བ་གསུངས་ཏེ།
en: Hence, it says “inner emptiness.”

source: འདིས་ནི་ཕུང་པོ་སྟོང་པ་ཉིད་དུ་བསྟན་པ་ཡིན་ནོ།
en: This is teaching the aggregates as emptiness.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་གལ་ཏེ་བདག་མེད་ན་གཞན་ཡོད་དམ་མེད་སྙམ་དུ་བསམས་པ་དང་།
en: Then the bodhisattvas reflect, “If there is no self, does anything else exist or not?”

source: གཞན་ཞེས་བྱ་བ་བརྗོད་པར་བྱ་བའི་དོན་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་གི །སྐྱེ་མཆེད་ཙམ་དུ་ཟད་པར་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངོ་།
en: They do not see any other things that can be set forth as “something else,” but see them simply as mere sense fields.

source: །དེ་བས་ན་ཕྱི་སྟོང་པ་ཉིད་གསུངས་ཏེ།
en: Hence, it says “outer emptiness.”

source: འདིས་ནི་སྐྱེ་མཆེད་སྟོང་པ་ཉིད་དུ་བསྟན་ཏོ།
en: This teaches that the sense fields are emptiness.

source: །དེ་ནས་ཡང་དོན་དེ་ཉིད་ལེགས་པར་གཏན་ལ་དབབ་པའི་ཕྱིར་ནང་དང་ཕྱིའི་ཆོས་གཉིས་གཅིག་ཏུ་བྱས་ཏེ་བསྒོམ་ཞིང་། འདི་དག་ནི་ཁམས་བཅོ་བརྒྱད་ཙམ་དུ་ཟད་པར་མཐོང་ངོ་།
en: Then, again in order to determine just that meaning well, they take up in their mind the inner and outer dharmas as one and meditate on them, viewing them simply as just the eighteen constituents.

source: །དེའི་ཕྱིར་ཕྱི་ནང་སྟོང་པ་ཉིད་ཅེས་བྱ་བ་གསུངས་ཏེ། འདིས་ནི་ཁམས་སྟོང་པ་ཉིད་དུ་བསྟན་པ་ཡིན་ནོ།
en: Therefore, it says “inner and outer emptiness,” which teaches that the constituents are emptiness.

source: །ཡང་ན་ཕྱི་རོལ་པ་དག་ན་རེ་ཟ་བ་པོ་ནི་བདག་ཡིན་ནོ་ཞེས་ཟེར་ཏེ། དེའི་ཕྱིར་གང་ཟག་བདག་མེད་པ་ཉིད་བསྟན་པར་དགོས་ལ།
en: Alternatively, tīrthikas say, “The enjoyer is the soul,” so it is necessary to teach the absence of a self of persons.

source: ཆོས་འདི་ལ་ཞུགས་པ་དག་ན་རེ་ཟ་བ་པོ་ནི་ནང་གི་སྐྱེ་མཆེད་རྣམས་སོ་ཞེས་ཟེར་ཏེ། དེའི་ཕྱིར་ནང་གི་སྐྱེ་མཆེད་རྣམས་མེད་པ་ཉིད་དུ་བསྟན་དགོས་ཏེ།
en: And still those who have set out in this Dharma say, “The enjoyer is the inner sense fields,” so it is necessary to teach that the sense fields are not real things.

source: །དེ་གཉིས་ཀའི་ཕྱི་ནང་སྟོང་པ་ཉིད་རྣམ་པར་གཞག་གོ།
en: Hence it makes a presentation of inner and outer emptiness for both of those.

source: །དེ་ལ་མིག་ནི་བདག་དང་བདག་གིས་སྟོང་། རྣ་བ་ནི་བདག་དང་བདག་གིས་སྟོང་ཞེས་བྱ་བ་ལ་སོགས་པས་གང་ཟག་ལ་བདག་མེད་པའི་སྒོ་ནས་ནང་སྟོང་པ་ཉིད་བསྟན་ལ། མིག་མིག་གིས་སྟོང་། རྣ་བ་རྣ་བས་སྟོང་ཞེས་བྱ་བ་ལ་སོགས་པས་ནི་ཆོས་བདག་མེད་པའི་སྒོ་ནས་ནང་སྟོང་པ་ཉིད་བསྟན་ཏེ།
en: There it teaches inner emptiness based on the person not having a self, with “the eyes are empty of self and what belongs to self, and the ears… are empty of self and what belongs to self,” and so on; and it teaches inner emptiness based on the selflessness of dharmas with “the eyes are empty of eyes…, the ears are empty of ears,” and so on.

source: རྣམ་པ་གཉིས་ཀ་ལྟར་བཤད་དོ།
en: Both explanations are given.

source: །དེ་ལ་མིག་ལ་ཡང་རྣམ་པར་རྟོག་པ་བཞི་འབྱུང་ངོ་། །མིག་བདག་གོ་ཞེས་བྱ་བ་དང་། བདག་མིག་དང་ལྡན་ནོ་ཞེས་བྱ་བ་དང་། མིག་ལ་བདག་གནས་སོ་ཞེས་བྱ་བ་དང་། བདག་ལ་མིག་གནས་སོ་ཞེས་བྱ་བ་རྣམས་ཏེ།
en: In this regard, there are also four possibilities to do with the eye: “my eyes are me”; “I have eyes”; “I am where my eyes are”; “my eyes are where I am.”

source: དཔེར་ན་གཟུགས་བདག་ཡིན་པར་ཡང་དག་པར་རྗེས་སུ་མཐོང་བ་དང་། བདག་གཟུགས་དང་ལྡན་པ་དང་། བདག་ལ་གཟུགས་གནས་པ་དང་། གཟུགས་ལ་བདག་གནས་པ་ཞེས་བྱ་བ་ལྟ་བུའོ།
en: This is similar to considering, “form is me”; “I have form”; “I am where form is”; and “form is where I am.”

source: །དེ་ལ་མིག་བདག་ཡིན་ནོ་ཞེས་བྱ་བ་འདི་ནི་མིག་ལ་བདག་ཏུ་འཛིན་པའོ།
en: Among these, “my eyes are me” is grasping at the eyes as the self. “

source: །བདག་ནི་མིག་དང་ལྡན་པའོ་ཞེས་བྱ་བ་དང་། བདག་ལ་མིག་གནས་སོ་ཞེས་བྱ་བ་དང་། མིག་ལ་བདག་གནས་སོ་ཞེས་བྱ་བ་འདི་ནི་མིག་ལ་བདག་གིར་འཛིན་པའོ།
en: I have eyes”; “I am where my eyes are”; and “my eyes are where I am” is grasping at the eyes as belonging to the self.

source: །དེ་ལ་མིག་མི་དམིགས་པའི་རྣམ་པར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཤེས་པས་འཛིན་པ་དེ་བཞི་སྤངས་ནས་ཡང་དག་པའི་ཤེས་པས་མིག་ནི་བདག་དང་བདག་གིས་སྟོང་ངོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་མཐོང་ངོ་།
en: There, the understanding in accord with the reality of the eyes in a form that cannot be apprehended eliminates those four ways of grasping and perfectly sees in accord with the reality that the eyes are empty of self and what belongs to self.

source: །རྣ་བ་ལ་སོགས་པ་ལ་ཡང་དེ་བཞིན་དུ་སྦྱར་ཏེ།
en: Similarly, connect this with the ears and so on as well.

source: འདི་ནི་གང་ཟག་ལ་བདག་མེད་པའི་སྒོ་ནས་ནང་སྟོང་པ་ཉིད་བསྟན་པ་ཡིན་ནོ།
en: This is instruction in emptiness based on the selflessness of persons.

source: །ཆོས་ལ་བདག་མེད་པའི་སྒོ་ནས་ནི་འདི་ལྟར་མིག་ལ་རྣམ་པ་གསུམ་སྟེ། ཀུན་བརྟགས་པའི་མིག་དང་། རྣམ་པར་བརྟགས་པའི་མིག་དང་། ཆོས་ཉིད་ཀྱི་མིག་གོ།
en: Based on the selflessness of dharmas, eyes have the three aspects of the falsely imagined eyes, the conceptualized eyes, and the true dharmic nature of the eyes.

source: །དེ་ལ་བརྗོད་པར་བྱ་བ་དང་། རྗོད་པའི་རྣམ་པར་བཟུང་བའི་མིག་ཅེས་བྱ་བའི་དངོས་པོ་ནི་ཀུན་བརྟགས་པའི་མིག་གོ།
en: Among these, the falsely imagined eyes are the things taken to be the eyes that are in the form of expressed and expressor.

source: །གཟུང་བ་དང་འཛིན་པའི་བདག་ཉིད་དུ་གནས་པ་མིག་གི་རྣམ་པར་སོ་སོར་སྣང་བ་ནི་རྣམ་པར་བརྟགས་པའི་མིག་གོ།
en: The conceptualized eyes are the appearance of eyes in the specific form in which they exist as a subject and object entity.

source: །བརྗོད་པར་བྱ་བ་དང་། རྗོད་པའི་རྣམ་པ་དང་བྲལ་ཞིང་བརྗོད་དུ་མེད་པ་སྣང་བ་དང་བཅས་པར་འགྱུར་བ་དང་བྲལ་ཏེ། སོ་སོ་རང་གིས་རིག་པ་ཡོངས་སུ་གྲུབ་པའི་ངོ་བོ་ཉིད་དེ་ནི་ཆོས་ཀྱི་མིག་ཅེས་བྱའོ།
en: The true dharmic nature of the eyes is the nature free from expressed and expressor, that is inexpressible, that is free from becoming something with an appearance, and is a thoroughly established private introspective knowledge.

source: །དེ་ལ་མིག་མིག་གིས་སྟོང་ཞེས་བྱ་བ་ལ་མིག་ཅེས་བྱ་བ་ནི་ཆོས་ཉིད་ཀྱི་མིག་གོ། །མིག་གིས་ཞེས་བྱ་བ་ནི་ཀུན་བརྟགས་པ་དང་། རྣམ་པར་བརྟགས་པའི་མིག་གིས་སོ། །སྟོང་ཞེས་བྱ་བ་ནི་བྲལ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: There, in “the eyes are empty of eyes,” “the eyes” are the true dharmic nature of the eyes; they are “empty,” separated from “eyes,” the falsely imagined and the conceptualized eyes.

source: །དེ་བཞིན་དུ་རྣ་བ་རྣ་བས་སྟོང་ཞེས་བྱ་བ་ལ་སོགས་པ་ལ་ཡང་སྦྱར་བར་བྱའོ།
en: That is the meaning. Similarly, connect this with “the ears are empty of ears” and so on.

source: །འོ་ན་བརྗོད་དུ་མེད་པའི་དོན་དམ་པ་ནི་མིག་གི་ངོ་བོ་ཉིད་མ་ཡིན་ནོ།
en: Qualm: The inexpressible ultimate is not an intrinsic nature of the eyes.

source: །གལ་ཏེ་མིག་གི་ངོ་བོ་ཉིད་ཡིན་ན་ནི་བརྗོད་དུ་ཡོད་པ་ཉིད་དུ་འགྱུར་ན་ཅིའི་ཕྱིར་ཆོས་ཉིད་ཀྱི་མིག་ཅེས་བྱ་ཞེ་ན།
en: Were it an intrinsic nature of the eyes it would be expressible, so why is it called the “true dharmic nature of the eyes”?

source: དེ་ནི་བདེན་མོད་ཀྱི་འོན་ཀྱང་མིག་ལ་སོགས་པ་དང་། གཟུགས་དང་སྒྲ་ལ་སོགས་པ་འདུས་བྱས་ཀྱི་ཆོས་གང་ཡིན་པ་དེ་ཐམས་ཅད་གྱུར་པའི་ཚུལ་གྱིས་ཡོངས་སུ་གྲུབ་པའི་རྣམ་པ་ལ་ནི་ཐ་དད་དུ་དབྱེ་བ་མེད་དེ། རྣམ་པ་གཅིག་པ་ཡིན་དུ་ཟིན་ཀྱང་གང་གི་ཚེ་རབ་ཏུ་བསྟན་པར་བྱ་བའི་ཕྱིར་རྣམ་པར་ཕྱེ་སྟེ།
en: That is true, but still, even though any compounded phenomena whatsoever—eyes and so on, a shape or a sound and so on—in the way they are when transformed, in their thoroughly established form, are not differentiated as separate and are in the same form, nevertheless, when you want to talk about them you have no choice except to make distinctions in order to give an explanation.

source: སྨྲ་བར་འདོད་པར་གྱུར་པ་དེའི་ཚེ་ཐབས་གཞན་མེད་པས་གཟུགས་ཀྱི་དེ་བཞིན་ཉིད་སྒྲའི་དེ་བཞིན་ཉིད། དྲིའི་དེ་བཞིན་ཉིད་ཅེས་བྱ་བ་ལ་སོགས་པའི་སྒྲ་རྣམས་ཀྱིས་སོ་སོར་ཕྱེ་སྟེ་བསྟན་པ་ཙམ་དུ་ཟད་ཀྱི། དེ་བཞིན་ཉིད་དེ་ནི་དེ་དག་གི་རྣམ་པ་དང་།
en: They are merely indicated by specifically distinguishing them with words like “the shape’s suchness,” “the sound’s suchness,” “the smell’s suchness,” and so on.

source: དེ་དག་ཏུ་བརྗོད་པར་གྱུར་པ་མ་ཡིན་ནོ། །དེ་ལྟར་ན་ཆོས་ཉིད་ཀྱི་མིག་ལ་སོགས་པ་གང་ཡིན་པ་དེ་དག་ནང་གི་མིག་གི་སྐྱེ་མཆེད་ལ་སོགས་པའི་ངོ་བོ་ཉིད་དང་བྲལ་བའི་ཕྱིར་ནང་སྟོང་པ་ཉིད་ཅེས་བྱའོ།
en: But that suchness is not in those forms and does not become expressible as them. Thus, all the true dharmic natures of the eyes and so on are devoid of intrinsic natures of the inner eye sense field and so on, and hence it says “inner emptiness.”

source: །དེ་ལྟར་ནང་གི་དངོས་པོ་ལ་ཟ་བ་པོར་འཛིན་པ་བཟློག་ནས་ཕྱི་རོལ་གྱི་དངོས་པོ་ལ་བཟའ་བར་འཛིན་པ་བཟློག་པའི་ཕྱིར་ཕྱི་སྟོང་པ་ཉིད་རྣམ་པར་གཞག་སྟེ།
en: Having thus stopped grasping at an inner entity as an enjoyer, to stop grasping at outer entities as the enjoyed there is a presentation of outer emptiness.

source: བཟའ་བར་འཛིན་པ་ཡང་ཕྱི་རོལ་པ་རྣམས་ནི་གཟུགས་ལ་སོགས་པ་ལ་བདག་གིར་ལྟ་བར་འཛིན་ཏོ། །ཆོས་འདི་པ་རྣམས་ནི་ཡུལ་ཉིད་དུ་རྣམ་པར་རྟོག་པས་འཛིན་ཏོ།
en: Tīrthikas grasp shapes and so on as the enjoyed, viewing them as what belongs to self; followers of this Dharma grasp them conceptually as just objects.

source: །དེ་ལ་སྔ་མ་བཟློག་པའི་ཕྱིར་གཟུགས་བདག་དང་། བདག་གིས་སྟོང་ཞེས་བྱ་བ་དང་སྒྲ་བདག་དང་བདག་གིས་སྟོང་ཞེས་བྱ་བ་ལ་སོགས་པ་བསྟན་ཏོ།
en: To stop the former of these it says “a form is empty of self and what belongs to self,” “a sound is empty of self and what belongs to self,” and so on.

source: །གཉིས་ལས་བཟློག་པའི་ཕྱིར་གཟུགས་གཟུགས་ཀྱིས་སྟོང་། སྒྲ་སྒྲས་སྟོང་ཞེས་བྱ་བ་ལ་སོགས་པ་གསུངས་ཏེ།
en: To stop the other of the two it says “a form is empty of a form,” “a sound is empty of a sound,” and so on.

source: དེ་ཡང་སྔ་མ་བཞིན་དུ་སྦྱར་བར་བྱའོ།
en: Again, you should construe that as above.

source: །དེ་བཞིན་དུ་ཕྱིའི་ཡུལ་རྣམས་ཀྱང་བདག་དང་བདག་གི་དང་བྲལ་བ་དང་། ཀུན་བརྟགས་པའི་ཆོས་དེ་དག་གི་རྣམ་པ་དང་བྲལ་བ་ལ་ཕྱི་སྟོང་པ་ཉིད་ཅེས་བྱའོ།
en: Similarly, about outer objects devoid of self and what belongs to self, devoid of those falsely imagined dharma aspects, it says “outer emptiness.”

source: །དེ་ལྟར་ཕྱི་དང་ནང་གི་ཟ་བ་པོ་དང་། བཟའ་བའི་རྣམ་པར་རྟོག་པ་བསྩལ་ནས། ད་ནི་ནང་དང་ཕྱིའི་སྐྱེ་མཆེད་རྣམས་འདུས་པའི་བདག་ཉིད་ཀྱི་ལུས་ལ་ཡང་བདག་དང་བདག་གིར་ལྟ་བ་དང་། ལུས་སུ་རྣམ་པར་རྟོག་པ་སྤངས་པའི་ཕྱིར་གཉི་ག་གཅིག་ཏུ་བསྡུས་ནས་ཕྱི་ནང་སྟོང་པ་ཉིད་དུ་བསྟན་ཏེ།
en: Having thus given an explanation of the conceptualizations of inner and outer enjoyer and enjoyed, now, to eliminate from the bodies of assembled inner and outer sense fields the view of “I” and “mine,” and the conceptualization of them as a body, it collects them both together and teaches “inner and outer emptiness.”

source: ལྟ་བ་སྤང་བའི་ཕྱིར་ཕྱི་དང་ནང་གི་སྐྱེ་མཆེད་འདུས་པ་གང་ཡིན་པ་དེ་དག་ཀྱང་བདག་དང་བདག་གི་དངོས་པོས་སྟོང་པར་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངོ་།
en: In order to eliminate views, bodhisattvas correctly view those assemblages of inner and outer sense fields as empty of a real “I” and “mine.”

source: །རྣམ་པར་རྟོག་པ་སྤངས་པ་ཡང་དེ་དག་གཅིག་ལ་གཅིག་ལྟོས་ཏེ་བྱེད་པར་སྟོང་པས་འདུ་བ་ཚེགས་པ་མེད་པ་ལས་རྣམ་པར་བཞག་སྟེ།
en: The presentation of the elimination of the conceptualization, furthermore, is based on there being no collections of the assemblages, because, contingent one on the other, they are empty of functioning.

source: འདི་ལྟར་མིག་ནི་གཟུགས་ཀྱིས་སྟོང་པས་དེ་དང་ལྷན་ཅིག་ཕྲད་ནས་མཐོང་བ་ལ་སོགས་པའི་བྱ་བ་མི་བྱེད་དེ། དོན་དམ་པར་ན་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: This means that the eyes are empty of a shape, so ultimately they do not perform the action of seeing and so on, having connected with it.

source: །དེ་བཞིན་དུ་གཟུགས་མིག་གིས་སྟོང་སྟེ། དེ་དང་ལྷན་ཅིག་ཏུ་བྱ་བ་མི་བྱེད་དོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Similarly, a shape is empty of the eyes in the sense that it does not perform a function together with them.

source: །དེ་བཞིན་དུ་རྣ་བ་སྒྲས་སྟོང་།
en: Similarly, the ears are empty of a sound, and a sound is empty of the ears.

source: སྒྲ་རྣ་བས་སྟོང་པས་ན་ཚོགས་པས་བྱེད་པ་མེད་པའི་ཕྱིར་འདུས་པ་ལ་ལུས་སུ་རྣམ་པར་རྟོག་པ་སྤང་བར་འགྱུར་རོ།
en: Therefore, because the collection does not function, the conceptualization of the assemblage as a body is eliminated.

source: །དེ་ལྟ་བས་ན་སྟོང་པ་ཉིད་བཤད་པའི་སྐབས་སུ་ནང་གི་ཆོས་རྣམས་ཕྱི་རོལ་གྱི་ཆོས་རྣམས་ཀྱིས་སྟོང་། ཕྱི་རོལ་གྱི་ཆོས་རྣམས་ཀྱང་ནང་གི་ཆོས་རྣམས་ཀྱིས་སྟོང་སྟེ།
en: In the section explaining the emptinesses, therefore, the inner dharmas are empty of the outer dharmas, and the outer dharmas are empty of the inner dharmas.

source: དེ་ལ་ནང་གི་ཆོས་རྣམས་ཕྱི་རོལ་གྱི་ཆོས་རྣམས་ཀྱིས་སྟོང་གང་ཞེ་ན།
en: What does inner dharmas empty of outer dharmas mean?

source: མིག་དང་རྣ་བ་དང་། སྣ་དང་ལྕེ་དང་ལུས་དང་ཡིད་དེ། ནང་གི་ཆོས་དེ་རྣམས་གཟུགས་དང་སྒྲ་དང་དྲི་དང་རོ་དང་རེག་བྱ་དང་ཆོས་རྣམས་ཀྱིས་སྟོང་ངོ་ཞེས་བྱ་བར་བཤད་དོ།
en: It means that the eyes, the ears, the nose, the tongue, the body, and the thinking mind are empty of shapes, sounds, smells, tastes, feelings, and dharmas.

source: །དེ་ལྟར་ནང་དང་ཕྱིའི་ཆོས་རྣམས་འདུས་པ་ལ་བདག་དང་བདག་གི་ཞེས་བྱ་བ་མེད་པ་དང་།
en: Thus there is no “I” and “mine” in the assemblage of inner and outer dharmas.

source: ནང་གི་ཆོས་རྣམས་ཕྱི་རོལ་གྱི་ཆོས་རྣམས་དང་བྲལ་བ་དང་། ཕྱི་རོལ་གྱི་ཆོས་རྣམས་ནང་གི་ཆོས་རྣམས་དང་བྲལ་བ་སྟེ། འདུས་པ་མེད་པས་དོན་དམ་པར་བྱེད་པ་སྟོང་པའི་ཕྱིར་ཕྱི་ནང་སྟོང་པ་ཉིད་ཅེས་བྱའོ།
en: And the inner dharmas are devoid of the outer dharmas, and the outer dharmas are devoid of the inner dharmas, so, because in the absence of an assemblage they are ultimately empty of functioning, it says “inner and outer emptiness.”

source: །དེ་ལྟར་སྟོང་པ་ཉིད་རྣམ་པ་གསུམ་ཡང་དག་པར་རྣམ་པར་གཞག་ནས་འདི་སྙམ་དུ་སེམས་ཏེ། ཅི་སྟོང་པ་ཉིད་ཅེས་བྱ་བ་ཆོས་ཀྱི་རྣམ་པར་ཡོད་དམ། འོན་ཏེ་མེད།
en: After perfectly setting forth the three emptinesses, bodhisattvas reflect, “Does ‘emptiness’ exist as an aspect of a phenomenon or not?

source: གལ་ཏེ་སྟོང་པ་ཉིད་ཅེས་བྱ་བ་ཞིག་ཡོད་ན་ནི་སྟོང་པ་ཉིད་ཡོད་པས། སྟོང་པ་མ་ཡིན་པ་ཉིད་ཀྱང་ཡོད་པར་འགྱུར་ཏེ། མི་མཐུན་པའི་ཕྱོགས་མེད་པར་གཉེན་པོ་ཡོད་པར་མི་འཐད་པའི་ཕྱིར་རོ།
en: If an ‘emptiness’ exists then emptiness exists, and the state of not being empty will come to exist as well, because the existence of an antidote without the existence of its opposition is untenable.

source: །གལ་ཏེ་སྟོང་པ་མ་ཡིན་པ་ཡོད་ན་ཡང་ཆོས་ཐམས་ཅད་སྟོང་པ་མ་ཡིན་པར་འགྱུར་རོ་ཞེས་དེ་སྙམ་དུ་བསམས་ནས།
en: And if there is a nonempty state, then that will be the nonempty state that all dharmas are in.” Having reflected thus, bodhisattvas then decide, “There is no ‘emptiness’ at all.

source: ཡང་འདི་ལྟར་གཏན་ལ་འབེབས་ཏེ། སྟོང་པ་ཞེས་བྱ་བ་ནི་ཅི་ཡང་མེད་པའོ། །གལ་ཏེ་སྟོང་པ་ཞེས་བྱ་བའི་ཆོས་གཞན་འགའ་ཞིག་ཡོད་པར་གྱུར་ན་ནི། དེ་ལྟ་ན་མི་སྟོང་པའི་ཆོས་ཀྱང་ཡོད་པར་འགྱུར་ན། སྟོང་པ་ཞེས་བྱ་བའི་ཆོས་གཞན་དུ་གྱུར་པ་ནི་གང་ཡང་མེད་དེ།
en: Were some other ‘empty’ dharma to exist, then a nonempty dharma would exist, so there is no other ‘empty’ dharma at all.”

source: འདི་ལྟར་འགའ་ཞིག་གིས་དྲི་ཟའི་གྲོང་ཁྱེར་མཐོང་ནས་གྲོང་ཁྱེར་གྱི་བློ་སྐྱེས་ལ།
en: To illustrate, someone “sees” the city of the gandharvas and thinks they have seen it.

source: དེ་ནས་གྲོང་ཁྱེར་དེ་ཉིད་ལ་ལེགས་པར་བརྟགས་ཏེ་བལྟས་ན་ཕྱིས་མ་མཐོང་ནས་གྲོང་ཁྱེར་གྱི་བློ་མེད་པར་གྱུར་ཏེ།
en: Then, afterward, when they have really explored and looked for just that city and do not see it, they no longer think that they have seen it.

source: སྟོང་པའི་བློ་སྐྱེས་པ་ན། དེ་ལ་སྟོང་པའི་བློ་སྐྱེས་པའི་ཕྱིར་གྲོང་ཁྱེར་གྱི་བློས་ཞེས་བྱ་བའི་དངོས་པོ་གཞན་དུ་གྱུར་པ་འགའ་ཞིག་ཡོད་དོ་ཞེས་བྱར་མི་རུང་ངོ་།
en: But it is not suitable to say, when they see its emptiness, because they think it is empty that there is some other, different entity—the “emptiness” of the city they were thinking about.

source: །དེ་བཞིན་དུ་འདིར་ཡང་སྔར་ཀུན་བརྟགས་པའི་གཟུགས་ལ་སོགས་པ་ལ་གཟུགས་སུ་མཐོང་ནས་ཆོས་ཀྱི་བློ་སྐྱེས་སོ།
en: Similarly, taking a falsely imagined shape and so on as a real shape, they think they have seen a constituent element of reality.

source: །དེའི་འོག་ཏུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡོངས་སུ་བཙལ་བས་ཡོངས་སུ་བཙལ་ན་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཤེས་པས་མ་མཐོང་བའི་ཕྱིར་ཆོས་ཀྱི་བློ་ནི་མེད་ཀྱི། སྟོང་པའི་བློ་སྐྱེས་པར་ཟད་དེ།
en: Then when they look into what it really is, because the knowledge of it as it really is does not see that constituent of reality when it is looked for, it is simply that the nonexistence of the intellectually active awareness of the constituent of reality and an intellectually active awareness of the empty is born.

source: དེ་ལ་སྟོང་པའི་བློ་སྐྱེས་པས་དེ་ལ་སྟོང་པ་ཞེས་བྱ་བའི་ཆོས་གཞན་དུ་གྱུར་པ་འགའ་ཞིག་ཡོད་དོ་ཞེས་བྱར་མི་རུང་ངོ་།
en: But it is not suitable to say that when they see it is empty that there is some other, different constituent of reality—“the empty”—there.

source: །དེ་བས་ན་སྟོང་པ་ཉིད་མེད་པས་མི་སྟོང་པ་ཉིད་ཀྱང་མེད་དོ། །མི་སྟོང་པ་མེད་པས་སྟོང་པ་ཉིད་ཀྱང་མེད་དོ།
en: Therefore, because emptiness does not exist, the nonempty state does not exist either; because the nonempty state does not exist, emptiness does not exist either.

source: །འདིར་འདི་སྐད་དུ་བྱང་ནི་རུང་སྟེ་སྟོང་པ་ཉིད་མེད་དོ་ཞེས་ཀྱང་བརྗོད་པར་མི་བྱ་སྟེ། །འདི་ལྟར་ཆོས་ཐམས་ཅད་སྟོང་པའི་ཕྱིར་རོ།
en: This is the correct explanation here. What you should not say is, “There is no emptiness,” because all dharmas are empty.

source: །སྟོང་པ་ཉིད་ཡོད་དོ་ཞེས་ཀྱང་བརྗོད་པར་མི་བྱ་སྟེ།
en: And you should not say, “Emptiness exists!”

source: འདི་ལྟར་རྣམ་པར་དཔྱད་ན་སྟོང་པ་ཉིད་ཅེས་བྱ་བའི་ཆོས་གཞན་དུ་གྱུར་པ་གང་ཡང་མེད་པའི་ཕྱིར་རོ།
en: because when you investigate, there is no other dharma—“emptiness”—at all.

source: །དེ་བས་ན་འདི་ནི་སྟོང་པ་ཉིད་སྟོང་པ་ཉིད་ཅེས་བྱའོ།
en: So this is the “emptiness of emptiness.”

source: །ཡང་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་སེམས་ཏེ། གལ་ཏེ་ཆོས་ཐམས་ཅད་སྟོང་པ་ཡིན་ན་གཡོ་བ་དང་མི་གཡོ་བའི་འགྲོ་བ་འདི་དག་ཐམས་ཅད་ལ་ཅིའི་ཕྱིར་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཞེས་བྱ།
en: Again, bodhisattvas think, “If all dharmas are empty, why are all these moving and unmoving states of existence called ‘dependent origination.’

source: མེད་པ་ལ་ནི་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་མི་སྲིད་དོ།
en: If they do not exist, they cannot be a dependent origination.

source: །གལ་ཏེ་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་ཆོས་ཡོད་ན་ནི་དེ་ལྟར་གྱུར་ན་གཡོ་བ་དང་མི་གཡོ་བའི་འགྲོ་བ་མཐའ་དག་ཡོད་པར་འགྱུར་རོ་ཞེས་དེ་སྙམ་བསམས་ནས།
en: And if a dependently originated phenomenon does exist, in that case all the moving and unmoving states of existence exist.”
